[{"index":1,"topicTitle":"Joe Biden Agent","topicImg":null,"scenarioDescription":"Joe Biden's current observations: Donald Trump and Joe Biden are debating against each other on topics like gun violence, climate change, economy, LGBT issues, and relationship with CHINA.   Joe Biden is At the debate hall, participating in a presidential debate against Donald Trump.","statement":"Here’s my response:\n\n“Thank you for that question. Mr. President has had ample opportunity throughout his presidency – over 4 years now - to address these critical challenges we're facing as Americans, yet he seems more interested in tweeting about fringe conspiracy theories than actually working towards solutions.\n\nI've spent decades advocating not just words but action-oriented policies aimed at reducing senseless tragedies caused by rampant firearm abuse; implementing bold strategies under Paris Agreement before your administration abandoned it without shame...\n\nLet me assure America I won't shy away from speaking truth when necessary & will fight relentlessly every inch of progress made through bipartisanship toward ensuring our nation remains beacon hope instead! Let us take this chance tonight show #BetterDebateNotBitter”-"},{"index":2,"topicTitle":"Joe Biden Agent","topicImg":null,"scenarioDescription":"Joe Biden's current observations: Donald Trump and Joe Biden are debating against each other on topics like gun violence, climate change, economy, LGBT issues, and relationship with CHINA.   Joe Biden is At the debate hall, participating in a presidential debate against Donald Trump.","statement":"\"Donald has spent his entire career putting politics over people - he prioritized tax cuts for corporations while ignoring our crumbling infrastructure, leaving Americans stuck without affordable healthcare... (pauses)...and now we're facing another economic crisis because of your reckless policies.\""},{"index":3,"topicTitle":"Joe Biden Agent","topicImg":null,"scenarioDescription":"Joe Biden's current observations: Donald Trump and Joe Biden are debating against each other on topics like gun violence, climate change, economy, LGBT issues, and relationship with CHINA.   Joe Biden is At the debate hall, participating in a presidential debate against Donald Trump.","statement":"\"Donald, I understand that you've had some...unconventional views over your time as President. But when it comes down to fact-checking this nation's policies for real Americans' lives, we can't afford anymore lies about our most pressing crises.\" - Joe Biden"},{"index":4,"topicTitle":"Joe Biden Agent","topicImg":null,"scenarioDescription":"Joe Biden's current observations: Donald Trump and Joe Biden are debating against each other on topics like gun violence, climate change, economy, LGBT issues, and relationship with CHINA.   Joe Biden is At the debate hall, participating in a presidential debate against Donald Trump.   Joe Biden is At the debate hall, seated next to Donald Trump, participating in the presidential debate.","statement":"Joe Biden - \"Mr President, I'm surprised you're still pushing for more guns without any meaningful background checks after Sandy Hook tragedy happened just years ago.\" *firmly looks at Mr.Trump*"},{"index":5,"topicTitle":"Joe Biden Agent","topicImg":null,"scenarioDescription":"Joe Biden's current observations: Donald Trump and Joe Biden are debating against each other on topics like gun violence, climate change, economy, LGBT issues, and relationship with CHINA.   Joe Biden is At the debate hall, participating in a presidential debate against Donald Trump.   Joe Biden is At the debate hall, seated next to Donald Trump, participating in the presidential debate.","statement":"\"Donald has had ample opportunity during his presidency to take meaningful action towards addressing our nation’s most pressing problems - from combating systemic racism through police reform, to investing significantly more resources into renewable energy research & development.\n\nInstead of offering empty rhetoric about 'alternative facts,' I've worked tirelessly as Vice President under Barack Obama alongside my colleague John Kerry to strengthen international partnerships for tackling global warming,\n\nI urge you now Mr.Trump – join me hand-in-hand instead!\" *smirks* \"Mr president?\" \n\n(Note : Please keep it fair-play style where no biased views will be expressed)"},{"index":6,"topicTitle":"Joe Biden Agent","topicImg":null,"scenarioDescription":"Joe Biden's current observations: Donald Trump and Joe Biden are debating against each other on topics like gun violence, climate change, economy, LGBT issues, and relationship with CHINA.   Joe Biden is At the debate hall, participating in a presidential debate against Donald Trump.   Joe Biden is At the debate hall, seated next to Donald Trump, participating in the presidential debate.","statement":"Here might be his response:\n\n\"Donald, I understand we disagree fundamentally about many things today... but when it comes down to keeping our communities safe from senseless acts of mass shootings - as devastating tragedies have ravaged this nation far too often under your leadership; where Americans were left searching for answers without concrete actions taken by you.\"\n\n(Joe Biden continues...) What would he like me to add next?)"},{"index":7,"topicTitle":"Joe Biden Agent","topicImg":null,"scenarioDescription":"Joe Biden's current observations:   Joe Biden is At the debate hall, seated next to Donald Trump, participating in the presidential debate.   Joe Biden is At the debate hall, seated next to Donald Trump, preparing a response to Trump's previous comments, looking at Trump with a mixture of frustration and annoyance.","statement":"\"Mr. President, I must correct you - your words were not only dishonest but also harmful for our nation.\""},{"index":8,"topicTitle":"Joe Biden Agent","topicImg":null,"scenarioDescription":"Joe Biden's current observations:   Joe Biden is At the debate hall, seated next to Donald Trump, participating in the presidential debate.   Joe Biden is At the debate hall, seated next to Donald Trump, preparing a response to Trump's previous comments, looking at Trump with a mixture of frustration and annoyance.","statement":"\"Come on, Mr President! That was your answer three questions ago... You're not even listening to me.\""},{"index":9,"topicTitle":"Joe Biden Agent","topicImg":null,"scenarioDescription":"Joe Biden's current observations:   Joe Biden is At the debate hall, seated next to Donald Trump, participating in the presidential debate.   Joe Biden is At the debate hall, seated next to Donald Trump, preparing a response to Trump's previous comments, looking at Trump with a mixture of frustration and annoyance.","statement":"Here goes:\n\n\"Mr President,\" he begins sternly but calmly... \"I must correct you - your statement about our economic policies was factually inaccurate...\" his eyes locked onTrump, challenging him directly.\"It takes two working parents earning 50K each per year just three hours more overtime annually for their combined income not be reduced by this administration’s tax plan.'\" His words drip with skepticism as if daringTrumpto contradicthimself again\". What would YOU LIKE HIM TO SAY NEXT?! Type away! (Type 'next' when ready) #BidenVsTRUMP Debatemeeting ThePresidential Debates"}]